content-org/control-flow.org
#+HUGO_BASE_DIR: ../
#+HUGO_WEIGHT: auto
#+HUGO_SECTION: control-flow
#+HUGO_PAIRED_SHORTCODES: katex
#+OPTIONS: ^:{}
#+PROPERTY: header-args:jupyter-julia :session control-flow :exports both :eval no-export :async yes

* Code Blocks
:PROPERTIES:
:EXPORT_FILE_NAME: code-blocks
:END:

A code block in Julia is used to group code together. They usually start with a keyword and end with the word =end=. The most basic block is the =begin= block.

** Begin Block

All the begin block does is group code together into a single expression. The last expression in the block is the blocks value. A begin block might look like this:

#+begin_src julia
begin
    x = 2
    y = 1
    x + y
end
#+end_src

Typing this in the REPL, you will see that the value of the last expression ~x + y~ is outputted.

#+BEGIN_EXPORT html
<pre class="julia-repl"><font color="#98C379"><b>julia&gt; </b></font>begin
       x = 2
       y = 1
       x + y
       end
3
</pre>
#+END_EXPORT

Everything from =begin= to =end= is replaced with the value of the last expression. For example, you can assign the value to a variable:

#+BEGIN_EXPORT html
<pre class="julia-repl"><font color="#98C379"><b>julia&gt; </b></font>y = begin
           x = 2 + 2
           x * 5
       end
20

<font color="#98C379"><b>julia&gt; </b></font>y
20
</pre>
#+END_EXPORT


You will also notice that the variables defined in the block are also accessible outside.

#+BEGIN_EXPORT html
<pre class="julia-repl"><font color="#98C379"><b>julia&gt; </b></font>x
4
</pre>
#+END_EXPORT

=begin= blocks are useful for running multiple lines of code in one REPL prompt. They are also when working with macros, which you will learn about in a later section.

** Function Block

You've already seen function blocks, but they are left here for completeness. They look like:

#+begin_src julia
function name_of_function(args)
    # code
end
#+end_src

A function block is actually equivalent to an assignment-style function with a =begin= block:

#+begin_src julia
name_of_function(args) = begin
    # code
end
#+end_src

It's usually better to just use a =function= block so it's clear you're defining a function.

** Let Block

A =let= block creates a new /local scope/ with the specified local variables.

#+begin_src julia
# x doesn't exist here

let x = 1
    # x is 1
    println(x)
end

# x doesn't exist here
#+end_src

You can specify multiple variables in the let block header by separating the assignments with commas.

#+begin_src julia
let x = 1, y = 2
    println(x + y)
end
#+end_src

Variables in the let block header replace outside variables for the duration of the block:

#+begin_src julia
x = 5
# x is 5
# y doesn't exist here

let x = 1, y = 2
    # x is 1
    # y is 2
    println(x + y)
end

# x is 5
# y doesn't exist here
#+end_src

** Other Blocks

Conditional blocks like =if=, =else=, and =elseif= can choose code to run based on a =true=/=false= condition. They will be covered in the next section.

=while= and =for= loops can run the same code multiple times. They will be covered after conditional blocks.

There are also blocks like =do=, =quote=, and =macro=.

